nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
/*
 * Copyright (c) 2022 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <unity.h>

#include <zephyr/kernel.h>
#include <fcntl.h>
#include <zephyr/sys/fdtable.h>
#include <zephyr/net/socket.h>
#include <nrf_socket.h>
#include <nrf_gai_errors.h>

#include "cmock_nrf_socket.h"
#include "cmock_nrf_modem_os.h"

#define HTTPS_HOSTNAME "example.com"
#define PORT 8080
#define WRONG_VALUE 4242
#define NRF_FD 2

void setUp(void)
{
}

void tearDown(void)
{
}

static struct test_state_nrf_getaddrinfo {
	struct nrf_addrinfo res;
	int ret;
} test_state_nrf_getaddrinfo;

static struct test_state_nrf_accept {
	struct nrf_sockaddr nrf_addr;
	nrf_socklen_t nrf_addrlen;
	int ret;
} test_state_nrf_accept;

static struct test_state_nrf_recvfrom {
	int ret;
	struct nrf_sockaddr cliaddr;
	nrf_socklen_t address_len;
} test_state_nrf_recvfrom;

static int nrf_getaddrinfo_stub(const char *p_node, const char *p_service,
				const struct nrf_addrinfo *p_hints,
				struct nrf_addrinfo **pp_res,
				int cmock_num_calls)
{
	*pp_res = k_malloc(sizeof(struct nrf_addrinfo));
	memcpy(*pp_res, &test_state_nrf_getaddrinfo.res, sizeof(struct nrf_addrinfo));

	return test_state_nrf_getaddrinfo.ret;
}

static int nrf_accept_stub(int socket, struct nrf_sockaddr *address,
			   nrf_socklen_t *address_len, int cmock_num_calls)
{
	*address = test_state_nrf_accept.nrf_addr;
	*address_len = test_state_nrf_accept.nrf_addrlen;

	return test_state_nrf_accept.ret;
}

static void nrf_freeaddrinfo_stub(struct nrf_addrinfo *p_res, int cmock_num_calls)
{
	if (p_res) {
		k_free(p_res);
	}
}

static ssize_t nrf_recvfrom_stub(int socket, void *buffer, size_t length,
				 int flags, struct nrf_sockaddr *address,
				 nrf_socklen_t *address_len,
				 int cmock_num_calls)
{
	struct nrf_sockaddr *cliaddr = (struct nrf_sockaddr *)address;

	if (cliaddr && address_len) {
		cliaddr->sa_family = test_state_nrf_recvfrom.cliaddr.sa_family;
		*address_len = test_state_nrf_recvfrom.address_len;
	}

	return test_state_nrf_recvfrom.ret;
}


void test_nrf91_socket_offload_getaddrinfo_errors(void)
{
	int ret;
	struct addrinfo *res;
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM,
	};

#define ERROR_SIZE 9
	int nrf_errors[ERROR_SIZE] = {
		NRF_EAI_AGAIN,
		NRF_EAI_BADFLAGS,
		NRF_EAI_FAIL,
		NRF_EAI_FAMILY,
		NRF_EAI_MEMORY,
		NRF_EAI_NONAME,
		NRF_EAI_SERVICE,
		NRF_EAI_SOCKTYPE,
		NRF_EAI_SYSTEM
	};
	int dns_errors[ERROR_SIZE] = {
		DNS_EAI_AGAIN,
		DNS_EAI_BADFLAGS,
		DNS_EAI_FAIL,
		DNS_EAI_FAMILY,
		DNS_EAI_MEMORY,
		DNS_EAI_NONAME,
		DNS_EAI_SERVICE,
		DNS_EAI_SOCKTYPE,
		DNS_EAI_SYSTEM
	};

	for (int i = 0; i < ERROR_SIZE; i++) {
		__cmock_nrf_getaddrinfo_ExpectAndReturn(HTTPS_HOSTNAME, NULL,
							NULL, NULL, nrf_errors[i]);
		__cmock_nrf_getaddrinfo_IgnoreArg_hints();
		__cmock_nrf_getaddrinfo_IgnoreArg_res();

		ret = getaddrinfo(HTTPS_HOSTNAME, NULL, &hints, &res);

		TEST_ASSERT_EQUAL(ret, dns_errors[i]);
	}
}

void test_nrf91_socket_offload_getaddrinfo_eai_family(void)
{
	int ret;
	struct addrinfo *res;
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM,
	};
	struct nrf_sockaddr_in info_in = { 0 };

	test_state_nrf_getaddrinfo.res.ai_family = WRONG_VALUE;
	test_state_nrf_getaddrinfo.res.ai_socktype = NRF_SOCK_STREAM;
	test_state_nrf_getaddrinfo.res.ai_protocol = NRF_IPPROTO_TCP;
	test_state_nrf_getaddrinfo.res.ai_addr = (struct nrf_sockaddr *)&info_in;
	test_state_nrf_getaddrinfo.ret = 0;

	__cmock_nrf_getaddrinfo_Stub(nrf_getaddrinfo_stub);
	__cmock_nrf_freeaddrinfo_Stub(nrf_freeaddrinfo_stub);

	ret = getaddrinfo(HTTPS_HOSTNAME, NULL, &hints, &res);

	TEST_ASSERT_EQUAL(ret, DNS_EAI_FAMILY);
}

void test_nrf91_socket_offload_getaddrinfo_ipv4_success(void)
{
	int ret;
	struct addrinfo *res;
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM,
		.ai_canonname = "name",
	};
	struct nrf_sockaddr_in info_in = { 0 };

	test_state_nrf_getaddrinfo.res.ai_family = NRF_AF_INET;
	test_state_nrf_getaddrinfo.res.ai_socktype = NRF_SOCK_STREAM;
	test_state_nrf_getaddrinfo.res.ai_protocol = NRF_IPPROTO_TCP;
	test_state_nrf_getaddrinfo.res.ai_addr = (struct nrf_sockaddr *)&info_in;
	test_state_nrf_getaddrinfo.ret = 0;

	__cmock_nrf_getaddrinfo_Stub(nrf_getaddrinfo_stub);
	__cmock_nrf_freeaddrinfo_Stub(nrf_freeaddrinfo_stub);

	ret = getaddrinfo(HTTPS_HOSTNAME, NULL, &hints, &res);
	TEST_ASSERT_EQUAL(ret, 0);

	TEST_ASSERT_EQUAL(res->ai_family, AF_INET);
	TEST_ASSERT_EQUAL(res->ai_socktype, SOCK_STREAM);
	TEST_ASSERT_EQUAL(res->ai_protocol, IPPROTO_TCP);
}

void test_nrf91_socket_offload_getaddrinfo_ipv6_success(void)
{
	int ret;
	struct addrinfo *res;
	struct addrinfo hints = {
		.ai_family = AF_INET6,
		.ai_socktype = SOCK_STREAM,
	};
	struct nrf_sockaddr_in6 info_in = { 0 };

	test_state_nrf_getaddrinfo.res.ai_family = NRF_AF_INET6;
	test_state_nrf_getaddrinfo.res.ai_socktype = NRF_SOCK_STREAM;
	test_state_nrf_getaddrinfo.res.ai_protocol = NRF_IPPROTO_TCP;
	test_state_nrf_getaddrinfo.res.ai_addr = (struct nrf_sockaddr *)&info_in;
	test_state_nrf_getaddrinfo.ret = 0;

	__cmock_nrf_getaddrinfo_Stub(nrf_getaddrinfo_stub);
	__cmock_nrf_freeaddrinfo_Stub(nrf_freeaddrinfo_stub);

	ret = getaddrinfo(HTTPS_HOSTNAME, NULL, &hints, &res);

	TEST_ASSERT_EQUAL(ret, 0);

	TEST_ASSERT_EQUAL(res->ai_family, AF_INET6);
	TEST_ASSERT_EQUAL(res->ai_socktype, SOCK_STREAM);
	TEST_ASSERT_EQUAL(res->ai_protocol, IPPROTO_TCP);
}

void test_nrf91_socket_offload_close_ebadf(void)
{
	int ret;

	ret = close(-1);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_create_close_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

