nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_socket_error(void)
{
	int fd;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, -1);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, -1);
}

void test_nrf91_socket_create_native_socket_eafnosupport(void)
{
	int fd;
	int family = AF_INET;
	int type = SOCK_STREAM | SOCK_NATIVE;
	int proto = IPPROTO_TCP;

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(errno, EAFNOSUPPORT);
	TEST_ASSERT_EQUAL(fd, -1);
}

void test_nrf91_socket_create_native_socket_tls_eafnosupport(void)
{
	int fd;
	int family = AF_INET6;
	int type = SOCK_STREAM | SOCK_NATIVE_TLS;
	int proto = IPPROTO_TLS_1_2;

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(errno, EAFNOSUPPORT);
	TEST_ASSERT_EQUAL(fd, -1);
}

void test_nrf91_socket_offload_create_close_proto_zero_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);

	fd = socket(family, type, 0);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_connect_ebadf(void)
{
	int ret;
	struct sockaddr address = { 0 };

	ret = connect(-1, &address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_connect_ipv4_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct sockaddr address = { 0 };

	/* IPv4 */
	address.sa_family = AF_INET;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_connect_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in), 0);
	__cmock_nrf_connect_IgnoreArg_address();

	ret = connect(fd, &address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_connect_ipv6_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET6;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct sockaddr address = { 0 };

	/* IPv6 */
	address.sa_family = AF_INET6;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET6, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_connect_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in6), 0);
	__cmock_nrf_connect_IgnoreArg_address();

	ret = connect(fd, &address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_connect_non_ip_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_PACKET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct sockaddr address = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_PACKET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_connect_ExpectAndReturn(nrf_fd, NULL, sizeof(address), 0);
	__cmock_nrf_connect_IgnoreArg_address();

	ret = connect(fd, &address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

/* The check for wrong socket is done in Zephyr before calling the offloading layer.
 * Still keeping this test since it proves that this case is being handled no matter the
 * Zephyr implementation.
 */
void test_nrf91_socket_offload_bind_ebadf(void)
{
	int ret;
	struct sockaddr_in address;

	address.sin_family = AF_INET;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	ret = bind(-1, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_bind_eafnosupport(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	struct sockaddr_in address;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET, SOCK_STREAM, 0);

	address.sin_family = WRONG_VALUE;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EAFNOSUPPORT);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_bind_ipv4_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	struct sockaddr_in address;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET, SOCK_STREAM, 0);

	address.sin_family = AF_INET;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_bind_ipv6_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	struct sockaddr_in address;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET6, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET6, SOCK_STREAM, 0);

	address.sin_family = AF_INET6;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in6), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_listen_ebadf(void)
{
	int ret;

	ret = listen(-1, 1);

