nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_listen_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	struct sockaddr_in address;
	int backlog = 1;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET6, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET6, SOCK_STREAM, 0);

	address.sin_family = AF_INET6;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in6), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_listen_ExpectAndReturn(nrf_fd, backlog, 0);

	ret = listen(fd, backlog);

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_accept_ebadf(void)
{
	int ret;
	struct sockaddr_in address;
	int addrlen = sizeof(address);

	address.sin_family = AF_INET;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	ret = accept(-1, (struct sockaddr *)&address, (socklen_t *)&addrlen);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_accept_addr_null_addrlen_null_error(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	struct sockaddr_in address;
	int backlog = 1;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET, SOCK_STREAM, 0);

	address.sin_family = AF_INET;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_listen_ExpectAndReturn(nrf_fd, backlog, 0);

	ret = listen(fd, backlog);

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_accept_ExpectAndReturn(nrf_fd, NULL, NULL, -2);

	ret = accept(fd, NULL, NULL);

	TEST_ASSERT_EQUAL(ret, -1);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_accept_addr_not_null_addrlen_not_null_enotsup(void)
{
	int ret;
	int fd;
	int accept_fd = 2;
	int nrf_fd = 1;
	struct sockaddr_in address;
	int addrlen = sizeof(address);
	int addrlen_unchanged = addrlen;
	int backlog = 1;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET, SOCK_STREAM, 0);

	address.sin_family = AF_INET;
	address.sin_addr.s_addr = INADDR_ANY;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_listen_ExpectAndReturn(nrf_fd, backlog, 0);

	ret = listen(fd, backlog);

	TEST_ASSERT_EQUAL(ret, 0);

	/* Modifying value to a wrong one to trigger the error case */
	test_state_nrf_accept.nrf_addr.sa_family = WRONG_VALUE;
	test_state_nrf_accept.ret = accept_fd;

	__cmock_nrf_accept_Stub(nrf_accept_stub);
	__cmock_nrf_close_ExpectAndReturn(accept_fd, 0);

	ret = accept(fd, (struct sockaddr *)&address, (socklen_t *)&addrlen);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, ENOTSUP);
	TEST_ASSERT_EQUAL(addrlen, addrlen_unchanged);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_accept_ipv4_success(void)
{
	int ret;
	int fd;
	int nrf_accept_fd = 2;
	int nrf_fd = 1;
	struct sockaddr_in address;
	int addrlen = sizeof(address);
	int addrlen_unchanged = addrlen;
	int backlog = 1;
	/* `z_reserve_fd` reserves fd = 1 first */
	int z_fd = 1;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET, SOCK_STREAM, 0);

	address.sin_family = AF_INET;
	address.sin_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_listen_ExpectAndReturn(nrf_fd, backlog, 0);

	ret = listen(fd, backlog);

	TEST_ASSERT_EQUAL(ret, 0);

	test_state_nrf_accept.nrf_addr.sa_family = NRF_AF_INET;
	test_state_nrf_accept.ret = nrf_accept_fd;

	__cmock_nrf_accept_Stub(nrf_accept_stub);

	ret = accept(fd, (struct sockaddr *)&address, (socklen_t *)&addrlen);

	TEST_ASSERT_EQUAL(ret, z_fd);
	TEST_ASSERT_EQUAL(addrlen, addrlen_unchanged);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);

	z_free_fd(z_fd);
}

void test_nrf91_socket_offload_accept_ipv6_success(void)
{
	int ret;
	int fd;
	int nrf_accept_fd = 2;
	int nrf_fd = 1;
	struct sockaddr_in6 address;
	int addrlen = sizeof(address);
	int addrlen_unchanged = addrlen;
	int backlog = 1;
	/* `z_reserve_fd` reserves fd = 1 first */
	int z_fd = 1;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET6, NRF_SOCK_STREAM, 0, nrf_fd);
	fd = socket(AF_INET6, SOCK_STREAM, 0);

	address.sin6_family = AF_INET6;
	address.sin6_port = htons(PORT);

	__cmock_nrf_bind_ExpectAndReturn(nrf_fd, NULL, sizeof(struct nrf_sockaddr_in6), 0);
	__cmock_nrf_bind_IgnoreArg_address();

	ret = bind(fd, (struct sockaddr *)&address, sizeof(address));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_listen_ExpectAndReturn(nrf_fd, backlog, 0);

	ret = listen(fd, backlog);

	TEST_ASSERT_EQUAL(ret, 0);

	test_state_nrf_accept.nrf_addr.sa_family = NRF_AF_INET6;
	test_state_nrf_accept.ret = nrf_accept_fd;

	__cmock_nrf_accept_Stub(nrf_accept_stub);

	ret = accept(fd, (struct sockaddr *)&address, (socklen_t *)&addrlen);

	TEST_ASSERT_EQUAL(ret, z_fd);
	TEST_ASSERT_EQUAL(addrlen, addrlen_unchanged);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);

	z_free_fd(z_fd);
}

void test_nrf91_socket_offload_setsockopt_ebadf(void)
{
	int ret;

