nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	ret = setsockopt(-1, 0, 0, NULL, 0);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_setsockopt_bindtodevice_eopnotsup(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	ret = setsockopt(fd, SOL_SOCKET, SO_BINDTODEVICE, &data, sizeof(data));

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EOPNOTSUPP);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);
	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_setsockopt_rcvtimeo_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_setsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_RCVTIMEO,
					       NULL, sizeof(struct nrf_timeval), 0);
	__cmock_nrf_setsockopt_IgnoreArg_option_value();

	ret = setsockopt(fd, SOL_SOCKET, SO_RCVTIMEO, &data, sizeof(data));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);
	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_setsockopt_sndtimeo_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_setsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_SNDTIMEO,
					       NULL, sizeof(struct nrf_timeval), 0);
	__cmock_nrf_setsockopt_IgnoreArg_option_value();

	ret = setsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &data, sizeof(data));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_setsockopt_tls_session_cache_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data = 0;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_setsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SECURE, NRF_SO_SEC_SESSION_CACHE,
					       NULL, sizeof(int), 0);
	__cmock_nrf_setsockopt_IgnoreArg_option_value();

	ret = setsockopt(fd, SOL_TLS, TLS_SESSION_CACHE, &data, sizeof(data));

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_getsockopt_ebadf(void)
{
	int ret;

	ret = getsockopt(-1, 0, 0, NULL, NULL);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_getsockopt_rcvtimeo_error(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };
	int data_len = sizeof(data);

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_getsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_RCVTIMEO,
					       NULL, NULL, -1);
	__cmock_nrf_getsockopt_IgnoreArg_option_value();
	__cmock_nrf_getsockopt_IgnoreArg_option_len();

	ret = getsockopt(fd, SOL_SOCKET, SO_RCVTIMEO, &data, &data_len);

	TEST_ASSERT_EQUAL(ret, -1);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_getsockopt_sndtimeo_error(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };
	int data_len = sizeof(data);

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_getsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_SNDTIMEO,
					       NULL, NULL, -1);
	__cmock_nrf_getsockopt_IgnoreArg_option_value();
	__cmock_nrf_getsockopt_IgnoreArg_option_len();

	ret = getsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &data, &data_len);

	TEST_ASSERT_EQUAL(ret, -1);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_getsockopt_rcvtimeo_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };
	int data_len = sizeof(data);

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_getsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_RCVTIMEO,
					       NULL, NULL, 0);
	__cmock_nrf_getsockopt_IgnoreArg_option_value();
	__cmock_nrf_getsockopt_IgnoreArg_option_len();

	/* Change `data_len` before calling so that we can see if the
	 * function changes it on return
	 */
	data_len = data_len + 1;

	ret = getsockopt(fd, SOL_SOCKET, SO_RCVTIMEO, &data, &data_len);

	TEST_ASSERT_EQUAL(ret, 0);
	TEST_ASSERT_EQUAL(data_len, sizeof(struct timeval));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_getsockopt_sndtimeo_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	struct timeval data = { 0 };
	int data_len = sizeof(data);

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

