nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_getsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_SNDTIMEO,
					       NULL, NULL, 0);
	__cmock_nrf_getsockopt_IgnoreArg_option_value();
	__cmock_nrf_getsockopt_IgnoreArg_option_len();

	/* Change `data_len` before calling so that we can see if the
	 * function changes it on return
	 */
	data_len = data_len + 1;

	ret = getsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &data, &data_len);

	TEST_ASSERT_EQUAL(ret, 0);
	TEST_ASSERT_EQUAL(data_len, sizeof(struct timeval));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_getsockopt_so_error_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	int data = 1;
	int data_len = 42;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	__cmock_nrf_getsockopt_ExpectAndReturn(nrf_fd, NRF_SOL_SOCKET, NRF_SO_ERROR, NULL, NULL, 0);
	__cmock_nrf_getsockopt_IgnoreArg_option_value();
	__cmock_nrf_getsockopt_IgnoreArg_option_len();
	__cmock_nrf_modem_os_errno_set_Expect(data);

	ret = getsockopt(fd, SOL_SOCKET, SO_ERROR, &data, &data_len);

	TEST_ASSERT_EQUAL(ret, 0);
	TEST_ASSERT_EQUAL(data, errno);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_recvfrom_ebadf(void)
{
	int ret;

	ret = recvfrom(-1, NULL, 0, 0, NULL, NULL);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_recvfrom_from_null_error(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_WAITALL;
	socklen_t fromlen = 0;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Expect that with `from` NULL the modem library call receives a forced
	 * `fromlen` NULL as well despite passing a pointer to the Zephyr call
	 */
	__cmock_nrf_recvfrom_ExpectAndReturn(nrf_fd, data, data_len, NRF_MSG_WAITALL,
					     NULL, NULL, -1);

	ret = recvfrom(fd, data, data_len, flags, NULL, &fromlen);

	TEST_ASSERT_EQUAL(ret, -1);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_recvfrom_from_null_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_WAITALL;
	socklen_t fromlen = 0;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Expect that with `from` NULL the modem library call receives a forced
	 * `fromlen` NULL as well despite passing a pointer to the Zephyr call
	 */
	__cmock_nrf_recvfrom_ExpectAndReturn(nrf_fd, data, data_len, NRF_MSG_WAITALL,
					     NULL, NULL, 8);

	ret = recvfrom(fd, data, data_len, flags, NULL, &fromlen);

	TEST_ASSERT_EQUAL(ret, 8);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_recvfrom_ipv4_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_WAITALL;
	struct sockaddr from = { 0 };
	socklen_t fromlen = 0;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	test_state_nrf_recvfrom.cliaddr.sa_family = NRF_AF_INET;
	test_state_nrf_recvfrom.address_len = sizeof(struct nrf_sockaddr_in);
	test_state_nrf_recvfrom.ret = 8;

	__cmock_nrf_recvfrom_Stub(nrf_recvfrom_stub);

	ret = recvfrom(fd, data, data_len, flags, &from, &fromlen);

	TEST_ASSERT_EQUAL(ret, 8);
	TEST_ASSERT_EQUAL(from.sa_family, AF_INET);
	TEST_ASSERT_EQUAL(fromlen, sizeof(struct sockaddr_in));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_recvfrom_ipv6_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_WAITALL;
	struct sockaddr from = { 0 };
	socklen_t fromlen = 0;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	test_state_nrf_recvfrom.cliaddr.sa_family = NRF_AF_INET6;
	test_state_nrf_recvfrom.address_len = sizeof(struct nrf_sockaddr_in6);
	test_state_nrf_recvfrom.ret = 8;

	__cmock_nrf_recvfrom_Stub(nrf_recvfrom_stub);

	ret = recvfrom(fd, data, data_len, flags, &from, &fromlen);

	TEST_ASSERT_EQUAL(ret, 8);
	TEST_ASSERT_EQUAL(from.sa_family, AF_INET6);
	TEST_ASSERT_EQUAL(fromlen, sizeof(struct sockaddr_in6));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendto_ebadf(void)
{
	int ret;

	ret = sendto(-1, NULL, 0, 0, NULL, 0);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_sendto_to_null_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_DONTWAIT;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

