nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Observe that the `tolen` parameter will be changed to zero when
	 * the `to` parameter is NULL
	 */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, data, data_len, NRF_MSG_DONTWAIT, NULL, 0, 8);

	ret = sendto(fd, data, data_len, flags, NULL, 42);

	TEST_ASSERT_EQUAL(ret, 8);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendto_ipv4_error(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_DONTWAIT;
	struct sockaddr to = { .sa_family = family };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Observe that the `tolen` parameter will be changed to size of struct
	 * `nrf_sockaddr_in` when the `to` parameter has `sa_family` with value
	 * `AF_INET`
	 */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, data, data_len,
					   NRF_MSG_DONTWAIT, NULL,
					   sizeof(struct nrf_sockaddr_in), -1);
	__cmock_nrf_sendto_IgnoreArg_dest_addr();

	ret = sendto(fd, data, data_len, flags, &to, 42);

	TEST_ASSERT_EQUAL(ret, -1);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendto_ipv4_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_DONTWAIT;
	struct sockaddr to = { .sa_family = family };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Observe that the `tolen` parameter will be changed to size of struct
	 * `nrf_sockaddr_in` when the `to` parameter has `sa_family` with value
	 * `AF_INET`
	 */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, data, data_len,
					   NRF_MSG_DONTWAIT, NULL,
					   sizeof(struct nrf_sockaddr_in), 8);
	__cmock_nrf_sendto_IgnoreArg_dest_addr();

	ret = sendto(fd, data, data_len, flags, &to, 42);

	TEST_ASSERT_EQUAL(ret, 8);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendto_ipv6_success(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET6;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_DONTWAIT;
	struct sockaddr to = { .sa_family = family };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET6, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	/* Observe that the `tolen` parameter will be changed to size of struct
	 * `nrf_sockaddr_in` when the `to` parameter has `sa_family` with value
	 * `AF_INET`
	 */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, data, data_len,
					   NRF_MSG_DONTWAIT, NULL,
					   sizeof(struct nrf_sockaddr_in6), 8);
	__cmock_nrf_sendto_IgnoreArg_dest_addr();

	ret = sendto(fd, data, data_len, flags, &to, 42);

	TEST_ASSERT_EQUAL(ret, 8);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendto_not_ipv4_not_ipv6_eafnosupport(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	uint8_t data[8] = { 1 };
	size_t data_len = sizeof(data);
	int flags = MSG_DONTWAIT;
	struct sockaddr to = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	ret = sendto(fd, data, data_len, flags, &to, 42);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EAFNOSUPPORT);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendmsg_ebadf(void)
{
	int ret;

	ret = sendmsg(-1, NULL, 0);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EBADF);
}

void test_nrf91_socket_offload_sendmsg_msg_null_einval(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	int flags = MSG_DONTWAIT;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	ret = sendmsg(fd, NULL, flags);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EINVAL);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendmsg_fits_buf(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	int flags = MSG_DONTWAIT;
	struct msghdr msg = { 0 };
	struct iovec chunks[2] = { 0 };
	int chunk_1 = 42;
	int chunk_2 = 43;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	chunks[0].iov_base = &chunk_1;
	chunks[0].iov_len = sizeof(int);
	chunks[1].iov_base = &chunk_2;
	chunks[1].iov_len = sizeof(int);
	msg.msg_iov = chunks;
	msg.msg_iovlen = 2;

	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, NULL, 2 * sizeof(int),
					   NRF_MSG_DONTWAIT,
					   NULL, 0, 2 * sizeof(int));
	__cmock_nrf_sendto_IgnoreArg_message();

	ret = sendmsg(fd, &msg, flags);

