nrfconnect/sdk-nrf/tests/lib/nrf_modem_lib/nrf91_sockets/src/nrf91_sockets_test.c
	TEST_ASSERT_EQUAL(ret, 2 * sizeof(int));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_sendmsg_not_fits_buf(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	int flags = MSG_DONTWAIT;
	struct msghdr msg = { 0 };
	struct iovec chunks[3] = { 0 };

	/* 3 ints are enough to surpass the defined size of the
	 * intermediate buffer (which is set to 8 bytes in this project)
	 */
	int chunk_1 = 42;
	int chunk_2 = 43;
	int chunk_3 = 44;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	chunks[0].iov_base = &chunk_1;
	chunks[0].iov_len = sizeof(int);
	chunks[1].iov_base = &chunk_2;
	chunks[1].iov_len = sizeof(int);
	chunks[2].iov_base = &chunk_3;
	chunks[2].iov_len = sizeof(int);
	msg.msg_iov = chunks;
	msg.msg_iovlen = 3;

	/* First send doesn't send all data of the first chunk */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, &chunk_1, sizeof(int),
					   NRF_MSG_DONTWAIT,
					   NULL, 0, sizeof(int) - 1);
	/* Second send will send the remaining part of the first chunk */
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, ((uint8_t *)&chunk_1) + sizeof(int) - 1, 1,
					   NRF_MSG_DONTWAIT,
					   NULL, 0, 1);
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, &chunk_2, sizeof(int),
					   NRF_MSG_DONTWAIT,
					   NULL, 0, sizeof(int));
	__cmock_nrf_sendto_ExpectAndReturn(nrf_fd, &chunk_3, sizeof(int),
					   NRF_MSG_DONTWAIT,
					   NULL, 0, sizeof(int));
	__cmock_nrf_sendto_IgnoreArg_message();

	ret = sendmsg(fd, &msg, flags);

	TEST_ASSERT_EQUAL(ret, 3 * sizeof(int));

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_fcntl_einval(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;
	int wrong_command = ~(F_SETFL | F_GETFL);

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	ret = fcntl(fd, wrong_command);

	TEST_ASSERT_EQUAL(ret, -1);
	TEST_ASSERT_EQUAL(errno, EINVAL);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_fcntl_f_setfl(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	__cmock_nrf_fcntl_ExpectAndReturn(nrf_fd, NRF_F_SETFL, NRF_O_NONBLOCK, 0);

	ret = fcntl(fd, F_SETFL, O_NONBLOCK);

	TEST_ASSERT_EQUAL(ret, 0);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

void test_nrf91_socket_offload_fcntl_f_getfl(void)
{
	int ret;
	int fd;
	int nrf_fd = 2;
	int family = AF_INET;
	int type = SOCK_STREAM;
	int proto = IPPROTO_TCP;

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_STREAM, NRF_IPPROTO_TCP, nrf_fd);

	fd = socket(family, type, proto);

	TEST_ASSERT_EQUAL(fd, 0);

	/* Skip connect, etc. since for testing we just
	 * need a working socket
	 */

	__cmock_nrf_fcntl_ExpectAndReturn(nrf_fd, NRF_F_GETFL, 0, NRF_O_NONBLOCK);

	ret = fcntl(fd, F_GETFL);

	TEST_ASSERT_EQUAL(ret, O_NONBLOCK);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);

	TEST_ASSERT_EQUAL(ret, 0);
}

static int stub_nrf_setsockopt_pollcb(int fd, int level, int opt, const void *val, size_t len,
				      int cmock_calls)
{
	struct nrf_pollfd fds = {
		.fd = NRF_FD,
		.events = NRF_POLLOUT,
		.revents = NRF_POLLOUT,
	};
	TEST_ASSERT_EQUAL(NRF_FD, fd);
	TEST_ASSERT_EQUAL(NRF_SOL_SOCKET, level);
	TEST_ASSERT_EQUAL(NRF_SO_POLLCB, opt);
	TEST_ASSERT_EQUAL(NRF_POLLOUT, ((struct nrf_modem_pollcb *)val)->events);
	TEST_ASSERT_EQUAL(true, ((struct nrf_modem_pollcb *)val)->oneshot);
	TEST_ASSERT_EQUAL(sizeof(struct nrf_modem_pollcb), len);
	TEST_ASSERT_EQUAL(0, cmock_calls); /* called once */
	/* Invoke callback */
	((struct nrf_modem_pollcb *)val)->callback(&fds);
	return 0;
}

void test_nrf91_socket_offload_poll(void)
{
	int ret;
	int fd;
	int nrf_fd = NRF_FD;
	int family = AF_INET;
	int type = SOCK_DGRAM;
	int proto = IPPROTO_UDP;
	struct pollfd fds[3] = { 0 };

	__cmock_nrf_socket_ExpectAndReturn(NRF_AF_INET, NRF_SOCK_DGRAM, NRF_IPPROTO_UDP, nrf_fd);

	fd = socket(family, type, proto);
	TEST_ASSERT_EQUAL(fd, 0);

	fds[0].fd = fd;
	fds[0].events = POLLOUT;
	fds[1].fd = 42;
	fds[1].events = POLLOUT;
	fds[2].fd = 43;
	fds[2].events = POLLOUT;

	__cmock_nrf_setsockopt_Stub(stub_nrf_setsockopt_pollcb);

	ret = poll(fds, 3, 0);
	TEST_ASSERT_EQUAL(3, ret);
	TEST_ASSERT_EQUAL(POLLOUT, fds[0].revents);
	TEST_ASSERT_EQUAL(POLLNVAL, fds[1].revents);
	TEST_ASSERT_EQUAL(POLLNVAL, fds[2].revents);

	__cmock_nrf_close_ExpectAndReturn(nrf_fd, 0);

	ret = close(fd);
	TEST_ASSERT_EQUAL(ret, 0);
}

/* It is required to be added to each test. That is because unity's
 * main may return nonzero, while zephyr's main currently must
 * return 0 in all cases (other values are reserved).
 */
extern int unity_main(void);

int main(void)
{
	(void)unity_main();

	return 0;
}
